regimantas/Arduino-PY32/libraries/Wire/src/utility/twi.c
/**
  ******************************************************************************
  * @file    twi.c
  * @author  HalfSweet
  * @version V1.0.0
  * @date    01-August-2016
  * @brief   provide the TWI interface
  *
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT(c) 2016 AirM2M</center></h2>
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of AirM2M nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */
#include "core_debug.h"
#include "utility/twi.h"
#include "PinAF_AIRF1.h"

#ifdef __cplusplus
extern "C" {
#endif

/* Private Defines */
/// @brief I2C timeout in tick unit
#ifndef I2C_TIMEOUT_TICK
#define I2C_TIMEOUT_TICK        100
#endif

#define SLAVE_MODE_TRANSMIT     0
#define SLAVE_MODE_RECEIVE      1
#define SLAVE_MODE_LISTEN       2

#if defined(PY32F0xx)
static uint8_t py32_pin_is_port_pin(PinName pin, uint8_t port_index, uint8_t pin_index)
{
  /*
   * PinName encoding differs per core. Support two common encodings:
   *  (1) 8-bit:  bits[3:0]=pin, bits[7:4]=port  (e.g. PA0=0x00, PF1=0x51)
   *  (2) 16-bit: bits[3:0]=pin, bits[11:8]=port (e.g. PF0=0x0500, PF1=0x0501)
   */
  uint32_t raw = (uint32_t)pin;

  if ((raw & 0xFFFFFF00UL) == 0UL) {
    return ((((raw >> 4) & 0x0FUL) == (uint32_t)port_index) && ((raw & 0x0FUL) == (uint32_t)pin_index)) ? 1U : 0U;
  }

  if ((raw & 0xFFFF0000UL) == 0UL) {
    return ((((raw >> 8) & 0x0FUL) == (uint32_t)port_index) && ((raw & 0x0FUL) == (uint32_t)pin_index)) ? 1U : 0U;
  }

  return 0U;
}

static void py32_try_i2c1_remap_pf01(i2c_t *obj)
{
  if ((obj == NULL) || (obj->i2c == NULL)) {
    return;
  }

  /* Only I2C1 has the common PF0/PF1 remap on PY32F0xx families. */
  if (obj->i2c != I2C1) {
    return;
  }

  /* Port F index is commonly 5 (A=0, B=1, ... F=5) in 8-bit PinName encoding. */
  const uint8_t PORT_F = 5;
  if (!py32_pin_is_port_pin(obj->sda, PORT_F, 0) ||
      !py32_pin_is_port_pin(obj->scl, PORT_F, 1)) {
    return;
  }

  /* Enable SYSCFG clock if required, then enable the I2C1 remap bit. */
#if defined(__HAL_RCC_SYSCFG_CLK_ENABLE)
  __HAL_RCC_SYSCFG_CLK_ENABLE();
#endif

#if defined(SYSCFG) && defined(SYSCFG_CFGR1_I2C1_RMP)
  SYSCFG->CFGR1 |= SYSCFG_CFGR1_I2C1_RMP;
#elif defined(SYSCFG) && defined(SYSCFG_CFGR1_I2C_RMP)
  SYSCFG->CFGR1 |= SYSCFG_CFGR1_I2C_RMP;
#endif
}

static void i2c_slave_irq_py32(i2c_t *obj)
{
  if (obj == NULL || obj->i2c == NULL) {
    return;
  }

  I2C_TypeDef *i2c = obj->i2c;
  uint32_t sr1 = i2c->SR1;

  /* Handle and clear errors early */
  if ((sr1 & I2C_SR1_BERR) == I2C_SR1_BERR) {
    CLEAR_BIT(i2c->SR1, I2C_SR1_BERR);
  }
  if ((sr1 & I2C_SR1_ARLO) == I2C_SR1_ARLO) {
    CLEAR_BIT(i2c->SR1, I2C_SR1_ARLO);
  }
  if ((sr1 & I2C_SR1_OVR) == I2C_SR1_OVR) {
    CLEAR_BIT(i2c->SR1, I2C_SR1_OVR);
  }
  if ((sr1 & I2C_SR1_AF) == I2C_SR1_AF) {
    /* NACK from master (typical end of read). Clear and go back to listen. */
    CLEAR_BIT(i2c->SR1, I2C_SR1_AF);
    obj->slaveTxIdx = 0;
    obj->i2cTxRxBufferSize = 0;
    obj->slaveMode = SLAVE_MODE_LISTEN;
  }

  /* Address matched: decide direction and prime TX if needed */
  if ((sr1 & I2C_SR1_ADDR) == I2C_SR1_ADDR) {
    volatile uint32_t tmp = i2c->SR1;
    (void)tmp;
    uint32_t sr2 = i2c->SR2; /* clears ADDR */

    /* If master is doing repeated-start (write then read), deliver RX bytes now. */
    if ((obj->slaveMode == SLAVE_MODE_RECEIVE) && (obj->slaveRxNbData != 0) && (obj->i2c_onSlaveReceive != NULL)) {
      obj->i2c_onSlaveReceive(obj);
      obj->slaveRxNbData = 0;
    }

    if ((sr2 & I2C_SR2_TRA) == I2C_SR2_TRA) {
      /* Master reads -> we transmit */
      obj->slaveMode = SLAVE_MODE_TRANSMIT;
      obj->slaveTxIdx = 0;

      if (obj->i2c_onSlaveTransmit != NULL) {
        obj->i2cTxRxBufferSize = 0;
        obj->i2c_onSlaveTransmit(obj);
      }

      uint8_t out = 0x00;
      if (obj->slaveTxIdx < obj->i2cTxRxBufferSize) {
        out = obj->i2cTxRxBuffer[obj->slaveTxIdx++];
      }
      i2c->DR = out;
    } else {
      /* Master writes -> we receive */
      obj->slaveMode = SLAVE_MODE_RECEIVE;
      obj->slaveRxNbData = 0;
    }
  }

  /* Stop condition: end of transaction */
  if ((sr1 & I2C_SR1_STOPF) == I2C_SR1_STOPF) {
    volatile uint32_t tmp = i2c->SR1;
    (void)tmp;
    SET_BIT(i2c->CR1, I2C_CR1_PE); /* clears STOPF */

    if ((obj->slaveMode == SLAVE_MODE_RECEIVE) && (obj->slaveRxNbData != 0) && (obj->i2c_onSlaveReceive != NULL)) {
      obj->i2c_onSlaveReceive(obj);
    }

    obj->slaveMode = SLAVE_MODE_LISTEN;
    obj->slaveRxNbData = 0;
    obj->slaveTxIdx = 0;
    obj->i2cTxRxBufferSize = 0;
  }

  /* RXNE: one byte received from master */
  if ((sr1 & I2C_SR1_RXNE) == I2C_SR1_RXNE) {
    uint8_t in = (uint8_t)i2c->DR;
    if (obj->slaveMode == SLAVE_MODE_RECEIVE) {
      if (obj->slaveRxNbData < I2C_TXRX_BUFFER_SIZE) {
        obj->i2cTxRxBuffer[obj->slaveRxNbData++] = in;
      }
    }
  }

  /* TXE: master expects another byte */
  if ((sr1 & I2C_SR1_TXE) == I2C_SR1_TXE) {
    if (obj->slaveMode == SLAVE_MODE_TRANSMIT) {
      uint8_t out = 0x00;
      if (obj->slaveTxIdx < obj->i2cTxRxBufferSize) {
        out = obj->i2cTxRxBuffer[obj->slaveTxIdx++];
      }
      i2c->DR = out;
    }
  }
}
#endif

/* Generic definition for series requiring I2C timing calculation */
#if !defined (AIR32F1xx) && !defined (AIRF2xx) && !defined (AIRF4xx) &&\
    !defined (AIRL1xx) && !defined(PY32F0xx)
#define I2C_TIMING
#endif

#ifdef I2C_TIMING
#ifndef I2C_VALID_TIMING_NBR
#define I2C_VALID_TIMING_NBR          8U
#endif
#define I2C_ANALOG_FILTER_DELAY_MIN  50U /* ns */
#ifndef I2C_ANALOG_FILTER_DELAY_MAX
#define I2C_ANALOG_FILTER_DELAY_MAX 260U /* ns */
#endif
#ifndef I2C_USE_ANALOG_FILTER
#define I2C_USE_ANALOG_FILTER         1U
#endif
#ifndef I2C_DIGITAL_FILTER_COEF
#define I2C_DIGITAL_FILTER_COEF       0U
#endif
#define I2C_PRESC_MAX                16U
#define I2C_SCLDEL_MAX               16U
#define I2C_SDADEL_MAX               16U
#define I2C_SCLH_MAX                256U
#define I2C_SCLL_MAX                256U
#define SEC2NSEC            1000000000UL

